app/controllers/pages_controller.rb

  def profile
   # grab the username from the URL as :id
   if (User.find_by_username(params[:id]))
    @username = params[:id]
  else
   # redirect to 404 (root for now)
   redirect_to root_path, :notice=> "User not found!"
  end

   @posts = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "joe"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "posts".* FROM "posts" WHERE (user_id = 3)  ORDER BY "posts"."created_at" DESC